// **********************************************
// 제 목 : CH13-2 3번 예제
// 날 짜 : 2026년 9월 18일
// 작성자 : 2401486 신재명
// **********************************************

#define _CRT_SECURE_NO_WARNINGS
#pragma disable(warning:6031)
#include <stdio.h>
int main()
{
	char arr[100]; // 문자열 배열 100칸 선언
	char* a = arr; // 포인터 a가 배열을 가르킨다

	printf("문자열을 입력하시오: ");
	scanf("%s", &arr);

	while (*a != '\0')// while문 포인터 a 즉 배열이 빈 공간을 만나면 종료
	{
		if (*a >= 'a' && *a <= 'z') // 포인터 a 가 아스키 코드로 소문자이면 32를 차감
		{
			*a = *a - 32;
		}
		else if (*a >= 'A' && *a <= 'Z') // 포인터 a 가 아스키 코드로 대문자이면 32를 증가
		{
			*a = *a + 32;
		}
		a++;
	}
	printf("변환결과: %s",arr);

	return 0;
}